//-------------------------------------------------------------------------*
//文件名: SCI.c (串行通信)                                                 *
//-------------------------------------------------------------------------*

//头文件
#include "SCI.h"       //该头文件包含SCI相关寄存器及标志位宏定义

//-------------------------------------------------------------------------*
//函数名: SCIInit                                                          *
//功  能: 初始化SCIx模块。x代表1，2                                        *
//参  数: uint8 SCINo: 第SCINo个SCI模块。其中SCINo取值为1，2               *
//                     如果SCINo大于2，则认为是2                           *
//        uint8 sysclk: 系统总线时钟，以MHz为单位                          *
//        uint16 baud:   波特率，如 4800，9600，19200，38400               *
//                      其他的波特率在MC9SO8DZ60的评估板上没有测试过，若要 *
//                      使用该函数，请自行测试，一般来说，速度慢一点，通信 *
//                      会更稳定                                           *
//返  回: 无                                                               *
//说  明: SCINo=1表示使用SCI1模块，依此类推。                              *
//-------------------------------------------------------------------------*
void SCIInit(uint8 SCINo, uint8 sysclk, uint16 baud)
{   
    uint16 ubgs;
    ubgs=0;
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    //1.计算波特率并设置:ubgs = fsys/(波特率*16)(其中fsys=sysclk*1000000)
    ubgs = sysclk*(10000/(baud/100))/16;  //理解参考上一行，此处便于CPU运算
    DZ60_SCI_BDH(SCINo) = (uint8)((ubgs & 0xFF00) >> 8); 
    DZ60_SCI_BDL(SCINo) = (uint8)(ubgs & 0x00FF);

    //无校验,正常模式(开始信号 + 8位数据(先发最低位) + 停止信号)
    DZ60_SCI_C1(SCINo) = 0;
    //允许发送,允许接收,查询方式收发
    DZ60_SCI_C2(SCINo) =  (0
        | DZ60_SCI_CTR2_TRANS_ENABLE 
        | DZ60_SCI_CTR2_RECV_ENABLE );
}  

//-------------------------------------------------------------------------*
//函数名: SCISend1                                                         *
//功  能: 串行发送1个字节                                                  *
//参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为1，2               *
//        uint8 ch:    要发送的字节                                        *
//返  回: 无                                                               *
//说  明: SCINo=1表示使用SCI1模块，依此类推                                *
//-------------------------------------------------------------------------*
void SCISend1(uint8 SCINo, uint8 ch)
{
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    while(!(DZ60_SCI_S1(SCINo) & DZ60_SCI_S1_TRANS_EMPTY));//判断发送缓冲区是否为空
    DZ60_SCI_D(SCINo) = ch;
}

//-------------------------------------------------------------------------*
//函数名: SCISendN                                                         *
//功  能: 串行发送N个字节                                                  *
//参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为1，2               *
//        uint8 n:      发送的字节数                                       *
//        uint8 ch[]:   待发送的数据                                       *
//返  回: 无                                                               *
//说  明: SCINo=1表示使用SCI1模块，依此类推                                *
//        调用了SCISend1函数                                               *
//-------------------------------------------------------------------------*
void SCISendN(uint8 SCINo, uint8 n, uint8 ch[])
{
    uint8 i;
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    for (i = 0; i < n; i++)          
  	    SCISend1(SCINo,ch[i]);
}

//-------------------------------------------------------------------------*
//函数名: SCIRe1                                                           *
//功  能: 从串口接收1个字节的数据                                          *
//参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为1，2               *
//返  回: 接收到的数(若接收失败，返回0xff)                                 *
//        uint8 *p:     接收成功标志的指针(0表示成功，1表示不成功)         *
//说  明: 参数*p带回接收标志，*p = 0，收到数据；*p = 1，未收到数据         *
//说  明: SCINo=1表示使用SCI1模块，依此类推                                *
//-------------------------------------------------------------------------*
uint8 SCIRe1(uint8 SCINo, uint8 *p)
{  
    uint16 k;
    uint8  i;
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    for (k = 0; k < 0xfbbb; k++)//有时间限制
        if((DZ60_SCI_S1(SCINo) & DZ60_SCI_S1_RECV_FULL) != 0)//判断接收缓冲区是否满
        {
            i = DZ60_SCI_D(SCINo);
            *p = 0x00; 
            break;
        } 
    
    if (k >= 0xfbbb)   //接受失败 
    {
	      i = 0xff;
	      *p = 0x01;
    }
    
    return i;
}

//-------------------------------------------------------------------------*
//函数名: SCIReN                                                           *
//功  能: 从串口接收N个字节的数据                                          *
//参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为1，2               *
//        uint8 n:      要接收的字节数                                     *
//        uint8 ch[]:   存放接收数据的数组                                 *
//返  回: 接收标志= 0 接收成功，= 1 接收失败                               *
//说  明: SCINo=1表示使用SCI1模块，依此类推                                *
//        调用了SCIRe1函数                                                 *
//-------------------------------------------------------------------------*
uint8 SCIReN(uint8 SCINo, uint8 n, uint8 ch[])
{
    uint8 m;
    uint8 fp;          //接收标志  
    m = 0;
    
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    while (m < n)
    { 	          
  	    ch[m] = SCIRe1(SCINo, &fp); 
  	    if (fp == 1)
  	    {
  	        return 1;  //接收失败
  	    }
  	    m++;
    } 
    
    return 0;          //接收成功	 
}        

//-------------------------------------------------------------------------*
//函数名: SCISendString                                                    *
//功  能: 串口传输字符串                                                   *
//参  数: uint8 SCINo: 第SCINo个SCI模块，其中SCINo取值为1，2               *
//        char *p: 要传输的字符串的指针                                    *
//返  回: 无                                                               *
//说  明: 字符串以'\0'结束                                                 *
//        调用了SCISend1 函数                                              *
//-------------------------------------------------------------------------*
void SCISendString(uint8 SCINo,char *p)
{
    uint32 k;    
    if(SCINo > 2)
    {  
        SCINo = 2;     //若传进的通道号大于2，则按照2来接收
    }
    if(p == 0) return;
    for(k = 0; p[k] != '\0'; ++k)
    {
        SCISend1(SCINo,p[k]);
    }
}


